In [232]:
import pandas as pd

In [233]:
df = pd.read_csv("./illinoisDistricts.csv")

In [234]:
df.head()

,COUNTYFP,NAME,G16PREDCLI,G16PRERTRU,G16PRELJOH,G16PREGSTE,G16PREOWRI,G16USSDDUC,G16USSRKIR,G16USSLMCM,G16USSGSUM,G16USSOWRI,G16COMDMEN,G16COMRMUN,G16COMLBAL,G16COMGCUR,NEIGHBORS,SUM
0,1,CLAYTON 1,76,359,10,1,2,175,260,5,7,0,117,299,10,9,"PEA RIDGE,CAMP POINT 1,NORTHEAST 1,HOUSTON 1,H...",274
1,1,NORTHEAST 1,72,350,17,5,1,138,283,16,6,0,118,299,17,5,"BIRMINGHAM,CHILI,AUGUSTA,CLAYTON 1,CAMP POINT ...",319
2,1,CAMP POINT 1,69,331,12,3,1,118,267,12,9,0,94,294,9,12,"CLAYTON 1,CAMP POINT 2,NORTHEAST 1,HOUSTON 1,C...",246
3,1,CAMP POINT 2,47,376,9,2,0,118,296,7,6,0,97,309,10,7,"HONEY CREEK 1,KEENE 1,CAMP POINT 1,HOUSTON 1,G...",318
4,1,MENDON 2,73,320,9,1,0,150,227,14,8,0,125,252,17,3,MENDON 1,38

In [235]:
dffinal = df.loc[:, ["NAME", "G16PREDCLI", "G16PRERTRU", "NEIGHBORS"]]

In [236]:
dffinal

,NAME,G16PREDCLI,G16PRERTRU,NEIGHBORS
0,CLAYTON 1,76,359,"PEA RIDGE,CAMP POINT 1,NORTHEAST 1,HOUSTON 1,H..."
1,NORTHEAST 1,72,350,"BIRMINGHAM,CHILI,AUGUSTA,CLAYTON 1,CAMP POINT ..."
2,CAMP POINT 1,69,331,"CLAYTON 1,CAMP POINT 2,NORTHEAST 1,HOUSTON 1,C..."
3,CAMP POINT 2,47,376,"HONEY CREEK 1,KEENE 1,CAMP POINT 1,HOUSTON 1,G..."
4,MENDON 2,73,320,MENDON 1
...,...,...,...,...
10085,GALESBURG CITY 12,208,182,"GALESBURG CITY 7,KNOX 5,KNOX 7,GALESBURG CITY ..."
10086,GALESBURG CITY 14,320,145,"GALESBURG CITY 21,GALESBURG CITY 22,GALESBURG ..."
10087,GALESBURG TOWNSHIP,63,128,"KELLY,HENDERSON 2,GALESBURG CITY 23,GALESBURG ..."
10088,GALESBURG CITY 1,253,271,"GALESBURG CITY 23,HENDERSON 1,GALESBURG CITY 2..."
10089,OSWEGO - 04,443,319,"9-4,OSWEGO - 34,OSWEGO - 37 AU01,AU10,W07P06,O..."

In [237]:
dffinal.to_csv("illinoisDistrictsTrimmed.csv", index = False)

In [324]:
smaller = dffinal.loc[0:10]

In [325]:
smaller

,NAME,G16PREDCLI,G16PRERTRU,NEIGHBORS
0,CLAYTON 1,76,359,"CAMP POINT 1,NORTHEAST 1,HOUSTON 1,CONCORD 1,C..."
1,NORTHEAST 1,72,350,"CLAYTON 1,CAMP POINT 1,HOUSTON 1"
2,CAMP POINT 1,69,331,"CLAYTON 1,CAMP POINT 2,NORTHEAST 1,HOUSTON 1,C..."
3,CAMP POINT 2,47,376,"HONEY CREEK 1,KEENE 1,CAMP POINT 1,HOUSTON 1,C..."
4,MENDON 2,73,320,MENDON 1
5,COLUMBUS 1,35,284,"HONEY CREEK 1,CLAYTON 1,CAMP POINT 1,CAMP POIN..."
6,PAYSON 1,109,412,
7,MELROSE 5,82,312,MELROSE 6
8,MELROSE 6,123,384,"ELLINGTON 2,MELROSE 5"
9,HOUSTON 1,16,112,"HONEY CREEK 1,KEENE 1,CLAYTON 1,CAMP POINT 1,C..."
10,KEENE 1,57,250,"HONEY CREEK 1,MENDON 1,LIMA 1,CAMP POINT 2,HOU..."

In [326]:
f = set(smaller.NAME)

In [327]:
j = smaller["NEIGHBORS"].str.split(",")
j

0     [CAMP POINT 1, NORTHEAST 1, HOUSTON 1, CONCORD...
1                  [CLAYTON 1, CAMP POINT 1, HOUSTON 1]
2     [CLAYTON 1, CAMP POINT 2, NORTHEAST 1, HOUSTON...
3     [HONEY CREEK 1, KEENE 1, CAMP POINT 1, HOUSTON...
4                                            [MENDON 1]
5     [HONEY CREEK 1, CLAYTON 1, CAMP POINT 1, CAMP ...
6                                                    []
7                                           [MELROSE 6]
8                              [ELLINGTON 2, MELROSE 5]
9     [HONEY CREEK 1, KEENE 1, CLAYTON 1, CAMP POINT...
10    [HONEY CREEK 1, MENDON 1, LIMA 1, CAMP POINT 2...
Name: NEIGHBORS, dtype: object

In [328]:
def mine(x):
    s = x
    for vert in s:
        if vert not in f:
            print(vert)

            s.remove(vert)
            print(s)
    return s

cleaned = j.apply(mine)

CONCORD 1
['CAMP POINT 1', 'NORTHEAST 1', 'HOUSTON 1', 'COLUMBUS 1']
HONEY CREEK 1
['KEENE 1', 'CAMP POINT 1', 'HOUSTON 1', 'COLUMBUS 1']
MENDON 1
[]
HONEY CREEK 1
['CLAYTON 1', 'CAMP POINT 1', 'CAMP POINT 2', 'MCKEE 1', 'LIBERTY 1', 'CONCORD 1']
MCKEE 1
['CLAYTON 1', 'CAMP POINT 1', 'CAMP POINT 2', 'LIBERTY 1', 'CONCORD 1']
CONCORD 1
['CLAYTON 1', 'CAMP POINT 1', 'CAMP POINT 2', 'LIBERTY 1']

[]
ELLINGTON 2
['MELROSE 5']
HONEY CREEK 1
['KEENE 1', 'CLAYTON 1', 'CAMP POINT 1', 'CAMP POINT 2', 'NORTHEAST 1']
HONEY CREEK 1
['MENDON 1', 'LIMA 1', 'CAMP POINT 2', 'HOUSTON 1']
LIMA 1
['MENDON 1', 'CAMP POINT 2', 'HOUSTON 1']

In [329]:
"CLAYTON 1" in smaller.NAME

False

In [330]:
"CLAYTON 1" not in f

False

In [331]:
cleaned[7]

['MELROSE 6']

In [332]:
smaller.loc[:,"NEIGHBORS"] = cleaned

In [333]:
smaller

,NAME,G16PREDCLI,G16PRERTRU,NEIGHBORS
0,CLAYTON 1,76,359,"[CAMP POINT 1, NORTHEAST 1, HOUSTON 1, COLUMBU..."
1,NORTHEAST 1,72,350,"[CLAYTON 1, CAMP POINT 1, HOUSTON 1]"
2,CAMP POINT 1,69,331,"[CLAYTON 1, CAMP POINT 2, NORTHEAST 1, HOUSTON..."
3,CAMP POINT 2,47,376,"[KEENE 1, CAMP POINT 1, HOUSTON 1, COLUMBUS 1]"
4,MENDON 2,73,320,[]
5,COLUMBUS 1,35,284,"[CLAYTON 1, CAMP POINT 1, CAMP POINT 2, LIBERT..."
6,PAYSON 1,109,412,[]
7,MELROSE 5,82,312,[MELROSE 6]
8,MELROSE 6,123,384,[MELROSE 5]
9,HOUSTON 1,16,112,"[KEENE 1, CLAYTON 1, CAMP POINT 1, CAMP POINT ..."
10,KEENE 1,57,250,"[MENDON 1, CAMP POINT 2, HOUSTON 1]"

In [334]:
def converttostr(input_seq, seperator):
   # Join all the strings in list
   final_str = seperator.join(input_seq)
   return final_str
finalIThink = smaller.iloc[0:21]
finalIThink["NEIGHBORS"] = finalIThink["NEIGHBORS"].apply(lambda x: converttostr(x, ","))
finalIThink

,NAME,G16PREDCLI,G16PRERTRU,NEIGHBORS
0,CLAYTON 1,76,359,"CAMP POINT 1,NORTHEAST 1,HOUSTON 1,COLUMBUS 1"
1,NORTHEAST 1,72,350,"CLAYTON 1,CAMP POINT 1,HOUSTON 1"
2,CAMP POINT 1,69,331,"CLAYTON 1,CAMP POINT 2,NORTHEAST 1,HOUSTON 1,C..."
3,CAMP POINT 2,47,376,"KEENE 1,CAMP POINT 1,HOUSTON 1,COLUMBUS 1"
4,MENDON 2,73,320,
5,COLUMBUS 1,35,284,"CLAYTON 1,CAMP POINT 1,CAMP POINT 2,LIBERTY 1"
6,PAYSON 1,109,412,
7,MELROSE 5,82,312,MELROSE 6
8,MELROSE 6,123,384,MELROSE 5
9,HOUSTON 1,16,112,"KEENE 1,CLAYTON 1,CAMP POINT 1,CAMP POINT 2,NO..."
10,KEENE 1,57,250,"MENDON 1,CAMP POINT 2,HOUSTON 1"

In [335]:
finalIThink

,NAME,G16PREDCLI,G16PRERTRU,NEIGHBORS
0,CLAYTON 1,76,359,"CAMP POINT 1,NORTHEAST 1,HOUSTON 1,COLUMBUS 1"
1,NORTHEAST 1,72,350,"CLAYTON 1,CAMP POINT 1,HOUSTON 1"
2,CAMP POINT 1,69,331,"CLAYTON 1,CAMP POINT 2,NORTHEAST 1,HOUSTON 1,C..."
3,CAMP POINT 2,47,376,"KEENE 1,CAMP POINT 1,HOUSTON 1,COLUMBUS 1"
4,MENDON 2,73,320,
5,COLUMBUS 1,35,284,"CLAYTON 1,CAMP POINT 1,CAMP POINT 2,LIBERTY 1"
6,PAYSON 1,109,412,
7,MELROSE 5,82,312,MELROSE 6
8,MELROSE 6,123,384,MELROSE 5
9,HOUSTON 1,16,112,"KEENE 1,CLAYTON 1,CAMP POINT 1,CAMP POINT 2,NO..."
10,KEENE 1,57,250,"MENDON 1,CAMP POINT 2,HOUSTON 1"

In [336]:
finalIThink.to_csv("500NodeTest.csv", index = False, float_format='%.0f')

In [337]:
clinton = finalIThink["G16PREDCLI"].sum()
clinton

759

In [338]:
trump = finalIThink["G16PRERTRU"].sum()
trump

3490

In [339]:
clinton + trump

4249

In [340]:
4249// 4

1062